//===============================================
//
//  内容   ： ビルボード処理
//  File   ： Billboard.h
//  制作者 ： 木崎　翔
//
//===============================================

//===============================================
// 
// 二重インクルード防止
// 
//===============================================
#ifndef _BILLBOARD_H_
#define _BILLBOARD_H_

//===============================================
//
//  インクルードファイル
//
//===============================================
#include "main.h"

//===============================================
//
// マクロ定義
//
//===============================================
#define BILLBOARD_MAX	(50)			// ビルボードの最大数

//------ 列挙型 ------
typedef enum
{
	TEXTURETYPE_RED = 0,
	TEXTURETYPE_GREEN,
	TEXTURETYPE_MAX
}TEXTURE_TYPE;

//===============================================
//
// 構造体定義
//
//===============================================
typedef struct
{
	D3DXVECTOR3 posBillboard;			// 位置
	D3DXVECTOR3 rotBillboard;			// 向き
	D3DXVECTOR3 sclBillboard;			// 大きさ

	D3DXMATRIX mtxViewBillboard;		// ワールドビュー
	D3DXMATRIX mtxWorldBillboard;		// ワールドマトリックス

	D3DCOLOR color;						// 色

	float fWidth;						// 幅
	float fHeight;						// 高さ
	float a;

	float fHeightFromParent;			// 親元からの高さ

	int nFrame;							// テクスチャの切り替わるスピード設定
	int nFrameCount;					// 切り替わるフレームを数える
	int nTexDevideX;					// テクスチャの分割数X
	int nTexDevideY;					// テクスチャの分割数Y
	int nTexNumX;						// テクスチャの現在の位置
	int nTexNumY;						// テクスチャの現在の位置

	TEXTURE_TYPE type;				// アニメーションの種類

	bool bLoop;						// アニメーションをループさせるかどうか
	bool bUse;						// 使用状況
}BILLBOARD;

//===============================================
//
//  関数プロトタイプ宣言
//
//===============================================

//===============================================
//
// ビルボードに関する初期化
//
//===============================================
void InitBillboard();		

//===============================================
//
// ビルボードに関する終了処理
//
//===============================================
void UninitBillboard(void);	

//===============================================
//
// ビルボードに関する更新処理
//
//===============================================
void UpdateBillboard( void );

//===============================================
//
// ビルボードに関する描画処理
//
//===============================================
void DrawBillboard( void );

//===============================================
//
// ビルボードの頂点情報セット
//
//===============================================
void SetupBillboard( void );

//===============================================
//
// ビルボードのセット
//
//===============================================
int SetBillboard( D3DXVECTOR3 pos, float fHeight, float fWidth, TEXTURE_TYPE type );

//===============================================
//
// ビルボードのポジション取得
//
//===============================================
BILLBOARD *GetBillboard(); 

//===============================================
//
// ビルボードの位置を設定
//
//===============================================
void SetPosBillboard( int num, D3DXVECTOR3 pos ); 

//===============================================
//
// ビルボードのOFF
//
//===============================================
void SetUseBillboard( int num ); 

#endif

