//===============================================
//
//  内容   ： バレット処理
//  File   ： Bullet.h
//  制作者 ： 木崎　翔
//
//===============================================

//===============================================
// 
// 二重インクルード防止
// 
//===============================================
#ifndef _BULLET_H_
#define _BULLET_H_

//===============================================
//
//  インクルードファイル
//
//===============================================
#include "main.h"

//===============================================
//
// マクロ定義
//
//===============================================
#define BULLET_MAX	(50)			// バレットの最大数

//===============================================
//
// 構造体定義
//
//===============================================

// 列挙型定義
typedef enum
{
	BULLETTYPE_ONP_RED = 0,
	BULLETTYPE_ONP_YELLOW,
	BULLETTYPE_ONP_BLUE,
	BULLETTYPE_MAX
}BULLETTYPE;

typedef struct
{
	D3DXVECTOR3 posBullet;			// 位置
	D3DXVECTOR3 rotBullet;			// 向き
	D3DXVECTOR3 sclBullet;			// 大きさ

	D3DXMATRIX mtxViewBullet;		// ワールドビュー
	D3DXMATRIX mtxWorldBullet;		// ワールドマトリックス

	D3DCOLOR color;						// 色

	D3DXVECTOR3 move;
	float fWidth;						// 幅
	float fHeight;						// 高さ
	int nShadowNum;						// 影のインデックス

	BULLETTYPE type;					// バレットタイプ

	bool bUse;							// 使用状況
}BULLET;

//===============================================
//
//  関数プロトタイプ宣言
//
//===============================================

//===============================================
//
// バレットに関する初期化
//
//===============================================
void InitBullet();		

//===============================================
//
// バレットに関する終了処理
//
//===============================================
void UninitBullet(void);	

//===============================================
//
// バレットに関する更新処理
//
//===============================================
void UpdateBullet(void);

//===============================================
//
// バレットに関する描画処理
//
//===============================================
void DrawBullet(void);

//===============================================
//
// バレットの頂点情報セット
//
//===============================================
void SetupBullet(void);

//===============================================
//
// バレットのセット
//
//===============================================
void SetBullet( D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 scl, D3DXVECTOR3 move, BULLETTYPE type );

//===============================================
//
// バレットの情報取得
//
//===============================================
BULLET *GetBullet(); 

//===============================================
//
// バレットの当たり判定情報取得
//
//===============================================
COL_RECT *GetRectBullet();



#endif