//-----------------------------------------------
//  内容：当たり判定
//  Fail:collision.h
//  制作者：木崎　翔
//-----------------------------------------------

//------------------------------------
// 二重インクルード防止
//------------------------------------
#ifndef _COLLISION_H_
#define _COLLISION_H_

//-----------------------------------------------
//  インクルードファイル
//-----------------------------------------------
#include "main.h"

// 当たり判定用の構造体
typedef struct
{
	D3DXVECTOR3 pos;
	D3DXVECTOR3 harfSize;
}COL_RECT;

//-----------------------------------------------
//  関数プロトタイプ宣言
//-----------------------------------------------

//-----------------------------------------------
// 円と円の当たり判定
// 引数：
// 中心座標x,y * 2、半径１、半径２
//-----------------------------------------------
bool ColCircle( COL_RECT *a, COL_RECT *b );

//-----------------------------------------------
// 矩形と矩形の当たり判定
// 引数：
// 中心座標x,y * 2、幅１、高さ１、幅２、高さ２
//-----------------------------------------------
bool ColRect( COL_RECT *a, COL_RECT *b );

//-----------------------------------------------
// 矩形と矩形の当たり判定
// 引数：
// 中心座標x,y * 2、幅１、高さ１、幅２、高さ２
//-----------------------------------------------
bool ColRectX_Right( COL_RECT *a, COL_RECT *b );

//-----------------------------------------------
// 矩形と矩形の当たり判定
// 引数：
// 中心座標x,y * 2、幅１、高さ１、幅２、高さ２
//-----------------------------------------------
bool ColRectX_Left( COL_RECT *a, COL_RECT *b );

//-----------------------------------------------
// 矩形と矩形の当たり判定
// 引数：
// 中心座標x,y * 2、幅１、高さ１、幅２、高さ２
//-----------------------------------------------
bool ColRectZ_Depth( COL_RECT *a, COL_RECT *b );

//-----------------------------------------------
// 矩形と矩形の当たり判定
// 引数：
// 中心座標x,y * 2、幅１、高さ１、幅２、高さ２
//-----------------------------------------------
bool ColRectZ_Front( COL_RECT *a, COL_RECT *b );

//-----------------------------------------------
// 矩形と円の当たり判定
// 引数：
// 中心座標x,y * 2、幅、高さ、半径
//-----------------------------------------------
//bool ColRectAndCircle(D3DXVECTOR3 pos1, float fWidth, float fHeight,D3DXVECTOR3 pos2, float fRad);

#endif