//-----------------------------------------------
//
//  内容：ゲーム処理
//  Fail:game.cpp
//  制作者：木崎　翔
//
//-----------------------------------------------

//-----------------------------------------------
//  インクルードファイル
//-----------------------------------------------
#include "game.h"
#include "model.h"
#include "meshField.h"
#include "shadow.h"
#include "wall.h"
#include "billboard.h"
#include "camera.h"
#include "light.h"
#include "pause.h"
#include "enemy.h"
#include "object.h"
#include "bullet.h"
#include "UI.h"
#include "number.h"
#include "timer.h"
#include "sky.h"
#include "effect.h"
#include "texture2D.h"
#include "score.h"
#include "miniMap.h"

//-----------------------------------------------
//　マクロ定義
//-----------------------------------------------

//-----------------------------------------------
//  関数プロトタイプ宣言
//-----------------------------------------------

//-----------------------------------------------
//  グローバル変数
//-----------------------------------------------
bool g_bGameFade = false;
bool g_bGameOver = false;
bool g_bPause = false;
GAME_MODE g_GameMode = G_GAME;

// ゲーム初期化
void InitGame()
{
	// グローバル変数初期化
	//------------------------------------
	g_bGameFade = false;
	g_bGameOver = false;
	g_bPause = false;
	g_GameMode = G_GAME;

	// 数字に関する初期化
	//------------------------------------
	InitNumber();

	// エフェクトの初期化
	//------------------------------------
	InitEffectEx();

	// 2Dテクスチャの初期化
	//------------------------------------
	InitTexture2D();

	// ミニマップの初期化
	//------------------------------------
	InitMiniMap();

	// ビルボード初期化処理
	//------------------------------------
	InitBillboard();

	// モデルの初期化
	//------------------------------------
	InitModel();

	// 敵の初期化
	//------------------------------------
	InitEnemy();

	// メッシュフィールド初期化処理
	//------------------------------------
	InitMeshField(10, 10, 300.0f, 300.0f);

	// 影初期化処理
	//------------------------------------
	InitShadow();

	// 壁初期化処理
	//------------------------------------
	InitWall();

	// カメラの初期化
	//------------------------------------
	InitCamera();

	// ライトの初期化
	//------------------------------------
	InitLight();

	// ポーズの初期化
	//------------------------------------
	InitPause();

	// オブジェクトの初期化
	//------------------------------------
	InitObject();

	// バレットの初期化
	//------------------------------------
	InitBullet();

	// UIの初期化
	//------------------------------------
	InitUI();

	// 空の初期化
	//------------------------------------
	InitSky();

	// タイマーの初期化
	//------------------------------------
	InitTimer();

	// スコアの初期化
	//------------------------------------
	InitScore();

	if ( GetMode() == MODE_GAME )
	{
		PlaySound( GAME_BGM );
	}

	//InitNumber();
}

// ゲーム終了処理
void UninitGame()
{
	// エフェクトの終了
	//------------------------------------
	UninitEffectEx();

	// 2Dテクスチャの終了
	//------------------------------------
	UninitTexture2D();

	// ミニマップの終了
	//------------------------------------
	UninitMiniMap();

	UninitModel();

	// 敵の終了処理
	//------------------------------------
	UninitEnemy();

	// メッシュフィールド初期化処理
	//------------------------------------
	UninitMeshField();

	// モデルの初期化
	//------------------------------------
	UninitModel();

	// 影初期化処理
	//------------------------------------
	UninitShadow();

	// ビルボード初期化処理
	//------------------------------------
	UninitBillboard();

	// 壁初期化処理
	//------------------------------------
	UninitWall();

	// カメラの終了
	//------------------------------------
	UninitCamera();

	// ライトの終了
	//------------------------------------
	UninitLight();

	// ポーズの終了
	//------------------------------------
	UninitPause();

	// オブジェクトの終了
	//------------------------------------
	UninitObject();

	// バレットの終了
	//------------------------------------
	UninitBullet();

	// UIの初期化
	//------------------------------------
	UninitUI();

	// 空の終了
	//------------------------------------
	UninitSky();

	// タイマー終了
	//------------------------------------
	UninitTimer();

	// スコア終了
	//------------------------------------
	UninitScore();

	StopSound();

	//UninitNumber();
}

// ゲーム更新処理
void UpdateGame()
{
	if ( GetFade() != FADE_NONE )
	{
		//return;
	}

	// カメラの更新
	//------------------------------------
	UpdateCamera();

	// ポーズ描画や更新の設定
	if ( GetMode() == MODE_GAME )
	{
		if ( ( GetKeyboardTrigger( DIK_P ) == true /*|| GetGamePadTrigger( GAMEPAD_A )*/ || GetPadElecomTrigger( PAD_10 ) ) && g_bPause == false )
		{
			PlaySound( MENUON_SE );
			g_bPause = true;
		}

		else if ( ( GetKeyboardTrigger( DIK_P ) == true /*|| GetGamePadTrigger( GAMEPAD_A )*/ || GetPadElecomTrigger( PAD_10 ) ) && g_bPause == true )
		{
			PlaySound( CANCEL_SE );
			g_bPause = false;
			SetPauseDraw( true );
		}

		if ( g_bPause == true )
		{
			UpdatePause();
			return;
		}
	}

	UpdateShadow();

	// ミニマップの更新
	//------------------------------------
	UpdateMiniMap();

	// エフェクトの更新
	//------------------------------------
	UpdateEffectEx();

	// 2Dテクスチャの更新
	//------------------------------------
	UpdateTexture2D();

	// メッシュフィールド更新処理
	//------------------------------------
	UpdateMeshField();

	// モデルの更新
	//------------------------------------
	UpdateModel();

	// 敵の更新
	//------------------------------------
	UpdateEnemy();

	// ビルボード更新処理
	//------------------------------------
	UpdateBillboard();

	// 壁更新処理
	//------------------------------------
	UpdateWall();

	// ライトの更新
	//------------------------------------
	UpdateLight();

	// オブジェクトの更新
	//------------------------------------
	UpdateObject();

	// バレットの更新
	//------------------------------------
	UpdateBullet();

	// UIの初期化
	//------------------------------------
	UpdateUI();

	// 空の更新
	//------------------------------------
	UpdateSky();

	if ( GetMode() == MODE_GAME )
	{
		// タイマー更新
		//------------------------------------
		UpdateTimer();
	}

	// スコア更新
	//------------------------------------
	UpdateScore();

	//UpdateNumber();

	if ( GetKeyboardTrigger( DIK_RSHIFT ) == true  && GetFade() == FADE_NONE )
	{
		SetFade( FADE_OUT );
		SetMode( MODE_RESULT );
	}
}

// ゲーム描画処理
void DrawGame()
{
	// 空の描画
	//------------------------------------
	DrawSky();

	// モデルの描画
	//------------------------------------
	DrawModel();

	// 敵の描画
	//------------------------------------
	DrawEnemy();

	// メッシュフィールド描画処理
	//------------------------------------
	DrawMeshField();

	// エフェクトの描画
	//------------------------------------
	DrawEffectEx();

	// 影描画処理
	//------------------------------------
	DrawShadow();

	// 壁描画処理
	//------------------------------------
	DrawWall();

	// バレットの描画
	//------------------------------------
	DrawBullet();

	// オブジェクトの描画
	//------------------------------------
	DrawObject();

	// ライトの描画
	//------------------------------------
	DrawLight();

	if ( GetMode() != MODE_TUTORIAL )
	{
		// タイマーの描画
		//------------------------------------
		DrawTimer();
	}

	// ビルボード描画処理
	//------------------------------------
	DrawBillboard();

	// 2Dテクスチャの描画
	//------------------------------------
	DrawTexture2D();

	// スコア描画
	//------------------------------------
	DrawScore();

	// UIの初期化
	//------------------------------------
	DrawUI();

	// ミニマップの描画
	//------------------------------------
	DrawMiniMap();

	// ポーズの描画
	//------------------------------------
	if ( g_bPause == true )
	{
		DrawPause();
	}
}

//===============================================
// ゲームオーバーの条件処理関数
//===============================================
void GameOver()
{
	
}

//===============================================
// ポーズ状態取得
//===============================================
bool GetPause( void )
{
	return g_bPause;
}	

//===============================================
// ポーズ状態セット
//===============================================
void SetPause( bool bPause )
{
	g_bPause = bPause;
}

GAME_MODE GetGameMode()
{
	return g_GameMode;
}