//===================================================================
//
//  内容：入力処理に必要なもの
//  Fail:input.h
//  制作者：木崎　翔
//
//===================================================================

//===================================================================
// 二重インクルード防止
//===================================================================
#ifndef _INPUT_H_
#define _INPUT_H_

//===================================================================
//
//  インクルードファイル
//
//===================================================================
#include "main.h"

//===================================================================
//
//　マクロ定義
//
//===================================================================
 
//===================================================================
//
//  関数プロトタイプ宣言
//
//===================================================================
HRESULT InitKeyboard(HINSTANCE hInstance, HWND hWnd);		// 入力処理の初期化処理
void UpdateKeyboard(void);									// 入力処理の更新処理
void UninitKeyboard(void);									// 入力処理の終了処理
bool GetKeyboardPress(int nKey);							// プレス情報取得
bool GetKeyboardTrigger(int nKey);							// トリガー情報の取得
bool GetKeyboardRelease(int nKey);							// リリース情報の取得
bool GetKeyboardRepeat(int nKey);							// リピート情報の取得

#endif