//-----------------------------------------------
//  内容：ミニマップ
//  File : miniMap.h
//  制作者：木崎　翔
//-----------------------------------------------
//------------------------------------
// 二重インクルード防止
//------------------------------------
#ifndef _MINIMAP_H_
#define _MINIMAP_H_

//-----------------------------------------------
//  インクルードファイル
//-----------------------------------------------
#include "main.h"

//------ マクロ定義 ------
#define MINIMAP_MAX ( 20 )

//------ 列挙型定義 ------
typedef enum
{
	MINIMAPTYPE_PLAYER = 0,
	MINIMAPTYPE_ENEMY,
	MINIMAPTYPE_BACK,
	MINIMAPTYPE_OBJECT,
	MINIMAPTYPE_MAX

}MINIMAPTYPE;

//------ 構造体定義 ------
typedef struct
{
	D3DXVECTOR3 pos;
	D3DXVECTOR3 worldPos;
	MINIMAPTYPE type;

	float fRotate;
	float fWidth;
	float fHeight;
	bool bUse;
}MINIMAP;

//-----------------------------------------------
//  関数プロトタイプ宣言
//-----------------------------------------------

//-----------------------------------------------
// ミニマップ初期化
//-----------------------------------------------
void InitMiniMap( void );

//-----------------------------------------------
// ミニマップ終了処理
//-----------------------------------------------
void UninitMiniMap( void );

//-----------------------------------------------
// ミニマップ更新処理
//-----------------------------------------------
void UpdateMiniMap( void );

//-----------------------------------------------
// ミニマップ描画処理
//-----------------------------------------------
void DrawMiniMap( void );

//-----------------------------------------------
// ミニマップセット
//-----------------------------------------------
void SetMiniMap( D3DXVECTOR3 pos, MINIMAPTYPE type, float fRot );

//-----------------------------------------------
// ミニマップセット
//-----------------------------------------------
MINIMAP *GetMiniMap( void );


#endif