//-----------------------------------------------
//  内容：四角描画
//  File : cube.h
//  制作者：木崎　翔
//-----------------------------------------------
//------------------------------------
// 二重インクルード防止
//------------------------------------
#ifndef _MOVECUBE_H_
#define _MOVECUBE_H_

//-----------------------------------------------
//  インクルードファイル
//-----------------------------------------------
#include "main.h"
#include "collision.h"

//------ マクロ定義 ------
#define MOVECUBE_MAX ( 100 )

//===============================================
//
// 構造体定義
//
//===============================================
typedef struct
{
	D3DXVECTOR3 pos;	
	D3DXVECTOR3 targetPos;	
	D3DXVECTOR3 initPos;	
	D3DXVECTOR3 rot;	
	D3DXVECTOR3 scl;	
	
	D3DXVECTOR3 move;	

	D3DXMATRIX mtxWorld;			// ワールドマトリックス
	LPD3DXMESH pMeshModel;			// メッシュ情報へのポインタ
	LPD3DXBUFFER pBuffMatModel;		// マテリアル情報へのポインタ
	DWORD numMatModel;				// マテリアルの数

	COL_RECT rect;

	int nGearIndex;
	bool bPosDecision;
	bool bMove;

	bool bUse;
}MOVECUBE;

//-----------------------------------------------
//  関数プロトタイプ宣言
//-----------------------------------------------

//-----------------------------------------------
// 四角描画初期化
//-----------------------------------------------
void InitMoveCube( void );

//-----------------------------------------------
// 四角描画終了処理
//-----------------------------------------------
void UninitMoveCube( void );

//-----------------------------------------------
// 四角描画更新処理
//-----------------------------------------------
void UpdateMoveCube( void );

//-----------------------------------------------
// 四角描画描画処理
//-----------------------------------------------
void DrawMoveCube( void );

//-----------------------------------------------
// 四角セット
//-----------------------------------------------
int SetMoveCube( D3DXVECTOR3 pos );

//-----------------------------------------------
// エディット更新
//-----------------------------------------------
void EditMoveCube( void );

//-----------------------------------------------
// 当たり判定の取得
//-----------------------------------------------
MOVECUBE *GetMoveCube( void );

//-----------------------------------------------
// 角度直し
//-----------------------------------------------
void ZeroMoveCubeRotation( void );

#endif