//===============================================
//
//  内容   ： オブジェクト処理
//  File   ： object.h
//  制作者 ： 木崎　翔
//
//===============================================

//===============================================
// 
// 二重インクルード防止
// 
//===============================================
#ifndef _OBJECT_H_
#define _OBJECT_H_

//===============================================
//
//  インクルードファイル
//
//===============================================
#include "main.h"

//===============================================
//
// マクロ定義
//
//===============================================
#define MAX_OBJECT ( 50 )

//===============================================
//
// 構造体定義
//
//===============================================
typedef enum
{
	OBJECTTYPE_A = 0,
	OBJECTTYPE_B,
	OBJECTTYPE_C,
	OBJECTTYPE_D,
	OBJECTTYPE_E,
	OBJECTTYPE_MAX
}OBJECTTYPE;

typedef struct
{
	D3DXVECTOR3 pos;				// 位置
	D3DXVECTOR3 rot;				// 角度
	D3DXVECTOR3 scl;				// スケール

	D3DXVECTOR3 harfSize;			// 大きさ

	D3DXMATRIX mtxWorld;			// ワールドマトリックス

	LPD3DXMESH pMeshObject;			// メッシュ情報へのポインタ
	LPD3DXBUFFER pBuffMatObject;	// マテリアル情報へのポインタ
	DWORD numMatObject;				// マテリアルの数
	LPDIRECT3DTEXTURE9 pTextureObject;		// テクスチャへのポインタ
	
	OBJECTTYPE type;
	bool bUse;
}OBJECT;

//===============================================
//
//  関数プロトタイプ宣言
//
//===============================================

//===============================================
//
// オブジェクトに関する初期化
//
//===============================================
void InitObject(void);	

//===============================================
//
// オブジェクトに関する終了処理
//
//===============================================
void UninitObject(void);	

//===============================================
//
// オブジェクトに関する更新処理
//
//===============================================
void UpdateObject(void);

//===============================================
//
// オブジェクトに関する描画処理
//
//===============================================
void DrawObject(void);

//===============================================
//
// オブジェクト構造体変数取得
//
//===============================================
void SetObject( D3DXVECTOR3 pos, OBJECTTYPE type );

//===============================================
//
// オブジェクト構造体変数取得
//
//===============================================
OBJECT *GetObject(void);

//===============================================
//
// 当たり判定の情報を取得
//
//===============================================
COL_RECT *GetRectObject();


#endif