//=======================================================================================
//	クラス：AT11C272 30623 13
//	制作者：木崎　翔
//	内容：ポーズ処理
//
//=======================================================================================

#ifndef _PAUSE_H_
#define _PAUSE_H_

//-----------------------------------------------
//
//  インクルードファイル
//
//-----------------------------------------------
#include "main.h"
#include "mode.h"
#include "game.h"

// 構造体定義
typedef enum
{
	CONTINUE = 0,
	RETRY,
	RETURN_TITLE,
	SELECT_MAX
}PAUSE_SELECT;

typedef struct
{
	D3DXVECTOR3 posPause;
	D3DXVECTOR3 rotPause;
	D3DXVECTOR3 sclPause;

	float fWidth;
	float fheight;
	float a;

	D3DXMATRIX mtxViewPause;				// ワールドビュー
	D3DXMATRIX mtxWorldPause;			// ワールドマトリックス
	D3DXMATRIX mtxProjectionPause;		// プロジェクションマトリックス
}PAUSE;

//-----------------------------------------------
//
//　ポーズ初期化
//　
//-----------------------------------------------
void InitPause(void);

//-----------------------------------------------
//
//　ポーズセットアップ
//　
//-----------------------------------------------
void SetupPause(void);

//-----------------------------------------------
//
//　ポーズ終了処理
//　
//-----------------------------------------------
void UninitPause(void);

//-----------------------------------------------
//
//　ポーズ更新処理
//　
//-----------------------------------------------
void UpdatePause(void);

//-----------------------------------------------
//
//　ポーズ描画処理
//　
//-----------------------------------------------
void DrawPause(void);

//-----------------------------------------------
//
//　ポーズ描画状態取得
//　
//-----------------------------------------------
bool GetPauseDraw( void );

//-----------------------------------------------
//
//　ポーズ描画状態セット
//　
//-----------------------------------------------
void SetPauseDraw( bool pauseDraw );


#endif