//-----------------------------------------------
//  内容：ランキング処理
//  File : ranking.h
//  制作者：木崎　翔
//-----------------------------------------------
//------------------------------------
// 二重インクルード防止
//------------------------------------
#ifndef _RANKING_H_
#define _RANKING_H_

//-----------------------------------------------
//  インクルードファイル
//-----------------------------------------------
#include "main.h"
#include "number.h"

//------ マクロ定義 ------
#define RANK_MAX ( 3 )

//------ 構造体宣言 ------
typedef struct
{
	int nScore[ RANK_MAX + 1 ];
}RANKING;

//-----------------------------------------------
//  関数プロトタイプ宣言
//-----------------------------------------------
// ランキング初期化
void InitRanking( void );	

// ランキング終了処理
void UninitRanking( void );	

// ランキング更新処理
void UpdateRanking( void );	

// ランキング描画処理
void DrawRanking( void );		

// ランキングロード処理
void LoadRanking( void );

#endif

