//===============================================
//
//  内容   ： 影処理
//  File   ： meshShadow.h
//  制作者 ： 木崎　翔
//
//===============================================

//===============================================
// 
// 二重インクルード防止
// 
//===============================================
#ifndef _SHADOW_H_
#define _SHADOW_H_

//===============================================
//
//  インクルードファイル
//
//===============================================
#include "main.h"

//===============================================
//
// マクロ定義
//
//===============================================

//===============================================
//
// 構造体定義
//
//===============================================
typedef struct
{
	D3DXVECTOR3 posShadow;			// 位置
	D3DXVECTOR3 rotShadow;			// 向き
	D3DXVECTOR3 sclShadow;			// 大きさ

	D3DXMATRIX mtxView;				// ワールドビュー
	D3DXMATRIX mtxWorld;			// ワールドマトリックス

	D3DCOLOR color;					// 色
	float r;
	float g;
	float b;
	float a;

	float fWidth;					// 幅
	float fHeight;					// 高さ

	bool bUse;						// 使用状況
}SHADOW;

//===============================================
//
//  関数プロトタイプ宣言
//
//===============================================

//===============================================
//
// 影に関する初期化
//
//===============================================
void InitShadow();		

//===============================================
//
// 影に関する終了処理
//
//===============================================
void UninitShadow(void);	

//===============================================
//
// 影に関する更新処理(インデックス指定)
//
//===============================================
void UpdateShadowEx( int num, D3DXVECTOR3 pos );

//===============================================
//
// 影の頂点情報セット(インデックス指定)
//
//===============================================
void SetupShadowEx( int num );

//===============================================
//
// 影に関する描画処理
//
//===============================================
void DrawShadow(void);

//===============================================
//
// 影の情報を取得する
//
//===============================================
SHADOW *GetShadow();

//===============================================
//
// 影のセット(インデックスを返す)
//
//===============================================
int SetShadowEx(D3DXVECTOR3 pos, D3DXVECTOR3 rot, D3DXVECTOR3 scl, float fWidth, float fHeight, float a);

void UpdateShadow( void );
void SetShadow(D3DXVECTOR3 pos, float fWidth, float fHeight, float a);

//===============================================
//
// 影の使用Off
//
//===============================================
void UseShadow( int num );


#endif

