//===============================================
//
//  内容   ： タイトルロゴ処理
//  File   ： titleLogo.h
//  制作者 ： 木崎　翔
//
//===============================================

//===============================================
// 
// 二重インクルード防止
// 
//===============================================
#ifndef _TITLELOGO_H_
#define _TITLELOGO_H_

//------ インクルードファイル ------
#include "main.h"

//------ マクロ定義 ------
#define TITLELOGO_MAX ( 2 )

//------ 構造体定義 ------
typedef struct
{
	D3DXVECTOR3 pos;
	D3DCOLOR color;

	float fWidth;
	float fHeight;
}TITLELOGO;

//------ 関数プロトタイプ宣言 ------

//===============================================
//
// タイトルロゴに関する初期化
//
//===============================================
void InitTitleLogo( void );		

//===============================================
//
// タイトルロゴに関する終了処理
//
//===============================================
void UninitTitleLogo(void);	

//===============================================
//
// タイトルロゴに関する更新処理
//
//===============================================
void UpdateTitleLogo(void);

//===============================================
//
// タイトルロゴに関する描画処理
//
//===============================================
void DrawTitleLogo(void);

//===============================================
//
// タイトルロゴの頂点情報セット
//
//===============================================
void SetupTitleLogo(void);





#endif